; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 315509 2 2 4 4 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(pointing satellite0 Planet5)
	(pointing satellite1 Star0)
	(have_image Star4 thermograph3)
	(have_image Planet5 infrared2)
	(have_image Star6 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
3. (turn_to satellite1 star6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star6)
   goals met: 0 of 5
4. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   goals met: 1 of 5
5. (turn_to satellite1 star0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star0)
   goals met: 2 of 5
6. (turn_to satellite0 groundstation2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 5
7. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 5
8. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 5
9. (turn_to satellite0 planet5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet5)
   goals met: 2 of 5
10. (turn_to satellite1 star6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star6)
   goals met: 1 of 5
11. (take_image satellite0 planet5 instrument1 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 2 of 5
12. (take_image satellite1 star6 instrument3 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 3 of 5
13. (turn_to satellite1 star4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star4)
   goals met: 3 of 5
14. (take_image satellite1 star4 instrument3 thermograph3)
   added: (have_image star4 thermograph3)
   goals met: 4 of 5
15. (turn_to satellite1 star0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star0)
   goals met: 5 of 5
